Public Member Functions | Public Attributes | Static Public Attributes | List of all members
APIVariant< Types > Struct Template Reference
API Infrastructure
Represents a variant in the API layer. More...
#include <API_ValueWrappers.hpp>
 Public Member Functions
 template<typename T >
void  | Put (T p)
 template<typename T >
T  | Get () const
 template<typename T >
bool  | IsType () const
 template<typename T >
APIVariant &  | operator= (T p)
 Public Attributes
 std::byte  | buffer [GS::Max(sizeof(Types)...)]
 UInt8  | typeIndex
 Static Public Attributes
 template<class T >
static constexpr bool  | Contains = GS::ParameterPack<Types...>::template Contains<T>
 template<class T >
static constexpr UInt8  | TypeToIndex = GS::ParameterPack<Types...>::template FindFirst<T>
Detailed Description
template<typename... Types>
 struct APIVariant< Types >
Represents a variant in the API layer.
Since
Archicad 27